# ProductSpecificationDescription Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..ProductSpecificationDescription Property
FabricationPart Class See Also
---
The product specification description of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string ProductSpecificationDescription { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProductSpecificationDescription As String
	Get
```

Visual C++
---
```text
public:
property String^ ProductSpecificationDescription {
	String^ get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace